Tekla.Structures.DirectManipulation.Model.ModelObjectSelectorHelper
The Tekla.Structures.DirectManipulation.Model.ModelObjectSelectorHelper class provides a set of static methods for selecting instances of type Tekla.Structures.Model.ModelObject.

Tekla.Structures.DirectManipulation.Model.ModelObjectSelectorHelper.SelectModelObjectLazy(Tekla.Structures.Model.Model,System.Int32)
Selects the Tekla.Structures.Model.ModelObject instance associated to the given identifier.
model: The Tekla.Structures.Model.Model to select the Tekla.Structures.Model.ModelObject from.
identifier: The identifier of the Tekla.Structures.Model.ModelObject to select.
Returns: An instance which will lazily select the Tekla.Structures.Model.ModelObject when System.Lazy`1.Value is called.

Tekla.Structures.DirectManipulation.Model.ModelObjectSelectorHelper.SelectModelObjectLazy(Tekla.Structures.Model.Model,Tekla.Structures.Identifier)
Selects the Tekla.Structures.Model.ModelObject instance associated to the given identifier.
model: The Tekla.Structures.Model.Model to select the Tekla.Structures.Model.ModelObject from.
identifier: The identifier of the Tekla.Structures.Model.ModelObject to select.
Returns: An instance which will lazily select the Tekla.Structures.Model.ModelObject when System.Lazy`1.Value is called.

Tekla.Structures.DirectManipulation.Model.ModelObjectSelectorHelper.SelectInViews(System.Collections.Generic.IEnumerable{Tekla.Structures.Internal.dotIdentifier_t},System.Boolean,System.Boolean)
Selects the model objects in the UI.
identifiers: The identifiers of the model objects.
useSubIds: A value indicating whether to use the object sub ids for selection.
suppressCallbacks: A value indicating whether to suppress the callbacks for the object selection changed event.
Returns: True on success; otherwise, false.